# SampleNumberingError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..NumberingFailures..::..SampleNumberingError Property
BuiltInFailures..::..NumberingFailures Class See Also
---
Replace this with the first real one
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SampleNumberingError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SampleNumberingError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SampleNumberingError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..NumberingFailures Class
Autodesk.Revit.DB Namespace